# 04 - Pandas - Processamento e Análise de Dados
## Aula 11 - 16 - Pandas - Renomeando Colunas e Índices de Dataframes

## Professor: Orlando Oliveira dos Santos, MsC.
 - E-mail: professor.orlando.santos@gmail.com 
 - Youtube :https://www.youtube.com/channel/UCPWWbkPWFmOjXH50TQWNAYg
 - Linkedin: https://linkedin.com/in/orlandoosantos
 - Facebook: https://www.facebook.com/proforlandosantosmsc/
 - Twitter: https://twitter.com/ProfOrlandoMsC
 - Instagram: https://www.instagram.com/proforlandosantosmsc/

## Formação Acadêmica
- Mestrado em Computação Aplicada - UnB (2014 – 2016)	
- MBA, Administração Estratégica de Sistemas de Informação – FGV (2011 – 2013)
- Tecnólogo em Processamento de Dados, Análise e Desenvolvimento de Sistemas – FAETEC/SP (2000-2002)

# Pandas - Renomeando Colunas e Índices de Dataframes

# Renomeando / mapeando rótulos 
O método rename() permite que você renomeie um eixo com base em algum mapeamento (um dicionário ou série) ou uma função arbitrária.

In [1]:
import numpy as np
import pandas as pd
df = pd.read_csv('./content/totaisregioes_arr.csv', sep=';',names =['REGIAO', 'CASOS','OBITOS'], index_col='REGIAO')
df.head()

                CASOS  OBITOS
REGIAO
Centro-Oeste   734005   15660
Nordeste      1553565   43546
Norte          739331   16428
Sudeste       2078787   76288
Sul            840161   15533

In [2]:
df['CASOS'].rename(str.upper).head()

REGIAO
CENTRO-OESTE     734005
NORDESTE        1553565
NORTE            739331
SUDESTE         2078787
SUL              840161
Name: CASOS, dtype: int64

### Um dicionário ou série também pode ser usado
- Se o mapeamento não incluir um rótulo de coluna / índice, ele não será renomeado

In [3]:
df.rename(columns={'CASOS': 'Qtd.Casos', 'OBITOS': 'Qtd. Obitos'},
          index={'Centro-Oeste': 'CO', 'Nordeste': 'NE', 'Norte': 'N', 
                 'Sudeste': 'SE', 'Sul': 'S'})

        Qtd.Casos  Qtd. Obitos
REGIAO
CO         734005        15660
NE        1553565        43546
N          739331        16428
SE        2078787        76288
S          840161        15533

In [4]:
df.rename({'CASOS': 'casos', 'OBITOS': 'obitos'}, axis='columns')

                casos  obitos
REGIAO
Centro-Oeste   734005   15660
Nordeste      1553565   43546
Norte          739331   16428
Sudeste       2078787   76288
Sul            840161   15533

In [5]:
df.rename({'Centro-Oeste': 'CO', 'Nordeste': 'NE', 'Norte': 'N', 
           'Sudeste': 'SE', 'Sul': 'S'}, axis='index')

          CASOS  OBITOS
REGIAO
CO       734005   15660
NE      1553565   43546
N        739331   16428
SE      2078787   76288
S        840161   15533

In [6]:
df

                CASOS  OBITOS
REGIAO
Centro-Oeste   734005   15660
Nordeste      1553565   43546
Norte          739331   16428
Sudeste       2078787   76288
Sul            840161   15533

### Usando rename inplace

In [7]:
df.rename(columns={'CASOS': 'casos', 'OBITOS': 'obitos'},
      index={'Centro-Oeste': 'CO', 'Nordeste': 'NE', 'Norte': 'N', 'Sudeste': 'SE', 'Sul': 'S'},
         inplace=True)
df

          casos  obitos
REGIAO
CO       734005   15660
NE      1553565   43546
N        739331   16428
SE      2078787   76288
S        840161   15533